bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAMC21_DFP/1.2.176/samc21/atdf/ATSAMC21J16A.atdf
        <module name="ADC" id="U2247" version="2.2.0">
          <instance name="ADC0">
            <register-group name="ADC0" name-in-module="ADC" address-space="base" offset="0x42004400"/>
            <signals>
              <signal group="AIN" index="0" function="B" pad="PA02"/>
              <signal group="AIN" index="1" function="B" pad="PA03"/>
              <signal group="AIN" index="2" function="B" pad="PB08"/>
              <signal group="AIN" index="3" function="B" pad="PB09"/>
              <signal group="AIN" index="4" function="B" pad="PA04"/>
              <signal group="AIN" index="5" function="B" pad="PA05"/>
              <signal group="AIN" index="6" function="B" pad="PA06"/>
              <signal group="AIN" index="7" function="B" pad="PA07"/>
              <signal group="AIN" index="8" function="B" pad="PA08"/>
              <signal group="AIN" index="9" function="B" pad="PA09"/>
              <signal group="AIN" index="10" function="B" pad="PA10"/>
              <signal group="AIN" index="11" function="B" pad="PA11"/>
              <signal group="VREFP" function="B" pad="PA03"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RESRDY" value="42" caption="index of DMA RESRDY trigger"/>
              <param name="EXTCHANNEL_MSB" value="11" caption="Number of external channels"/>
              <param name="GCLK_ID" value="33" caption="index of Generic Clock"/>
              <param name="INT_CH30" value="0" caption="Select OPAMP or CTAT on Channel 30"/>
              <param name="MASTER_SLAVE_MODE" value="1" caption="ADC Master/Slave Mode"/>
              <param name="INSTANCE_ID" value="81"/>
            </parameters>
          </instance>
          <instance name="ADC1">
            <register-group name="ADC1" name-in-module="ADC" address-space="base" offset="0x42004800"/>
            <signals>
              <signal group="AIN" index="0" function="B" pad="PB00"/>
              <signal group="AIN" index="1" function="B" pad="PB01"/>
              <signal group="AIN" index="2" function="B" pad="PB02"/>
              <signal group="AIN" index="3" function="B" pad="PB03"/>
              <signal group="AIN" index="4" function="B" pad="PB08"/>
              <signal group="AIN" index="5" function="B" pad="PB09"/>
              <signal group="AIN" index="6" function="B" pad="PB04"/>
              <signal group="AIN" index="7" function="B" pad="PB05"/>
              <signal group="AIN" index="8" function="B" pad="PB06"/>
              <signal group="AIN" index="9" function="B" pad="PB07"/>
              <signal group="AIN" index="10" function="B" pad="PA08"/>
              <signal group="AIN" index="11" function="B" pad="PA09"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RESRDY" value="43" caption="index of DMA RESRDY trigger"/>
              <param name="EXTCHANNEL_MSB" value="11" caption="Number of external channels"/>
              <param name="GCLK_ID" value="34" caption="index of Generic Clock"/>
              <param name="INT_CH30" value="0" caption="Select OPAMP or CTAT on Channel 30"/>
              <param name="MASTER_SLAVE_MODE" value="2" caption="ADC Master/Slave Mode"/>
              <param name="INSTANCE_ID" value="82"/>
            </parameters>
          </instance>
        </module>
        <module name="CAN" id="U2003" version="2.0.0">
          <instance name="CAN0">
            <register-group name="CAN0" name-in-module="CAN" address-space="base" offset="0x42001C00"/>
            <signals>
              <signal group="RX" function="G" pad="PA25"/>
              <signal group="RX" function="G" pad="PB23"/>
              <signal group="TX" function="G" pad="PA24"/>
              <signal group="TX" function="G" pad="PB22"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_DEBUG" value="14" caption="DMA CAN Debug Req"/>
              <param name="GCLK_ID" value="26" caption="Index of Generic Clock"/>
              <param name="MSG_RAM_ADDR" value="0x200000000"/>
              <param name="QOS_RESET_VAL" value="2" caption="QOS reset value"/>
              <param name="INSTANCE_ID" value="71"/>
            </parameters>
          </instance>
          <instance name="CAN1">
            <register-group name="CAN1" name-in-module="CAN" address-space="base" offset="0x42002000"/>
            <signals>
              <signal group="RX" function="G" pad="PB11"/>
              <signal group="RX" function="G" pad="PB15"/>
              <signal group="TX" function="G" pad="PB10"/>
              <signal group="TX" function="G" pad="PB14"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_DEBUG" value="15" caption="DMA CAN Debug Req"/>
              <param name="GCLK_ID" value="27" caption="Index of Generic Clock"/>
              <param name="MSG_RAM_ADDR" value="0x200000000"/>
              <param name="QOS_RESET_VAL" value="2" caption="QOS reset value"/>
              <param name="INSTANCE_ID" value="72"/>
            </parameters>
          </instance>
        </module>
        <module name="CCL" id="U2225" version="1.0.1">
          <instance name="CCL">
            <register-group name="CCL" name-in-module="CCL" address-space="base" offset="0x42005C00"/>
            <signals>
              <signal group="IN" index="0" function="I" pad="PA04"/>
              <signal group="IN" index="0" function="I" pad="PA16"/>
              <signal group="IN" index="0" function="I" pad="PB22"/>
              <signal group="IN" index="1" function="I" pad="PA05"/>
              <signal group="IN" index="1" function="I" pad="PA17"/>
              <signal group="IN" index="1" function="I" pad="PB00"/>
              <signal group="IN" index="2" function="I" pad="PA06"/>
              <signal group="IN" index="2" function="I" pad="PA18"/>
              <signal group="IN" index="2" function="I" pad="PB01"/>
              <signal group="IN" index="3" function="I" pad="PA08"/>
              <signal group="IN" index="3" function="I" pad="PA30"/>
              <signal group="IN" index="4" function="I" pad="PA09"/>
              <signal group="IN" index="5" function="I" pad="PA10"/>
              <signal group="IN" index="5" function="I" pad="PB10"/>
              <signal group="IN" index="6" function="I" pad="PA22"/>
              <signal group="IN" index="6" function="I" pad="PB06"/>
              <signal group="IN" index="7" function="I" pad="PA23"/>
              <signal group="IN" index="7" function="I" pad="PB07"/>
              <signal group="IN" index="8" function="I" pad="PA24"/>
              <signal group="IN" index="8" function="I" pad="PB08"/>
              <signal group="IN" index="9" function="I" pad="PB14"/>
              <signal group="IN" index="10" function="I" pad="PB15"/>
              <signal group="IN" index="11" function="I" pad="PB16"/>
              <signal group="OUT" index="0" function="I" pad="PA07"/>
              <signal group="OUT" index="0" function="I" pad="PA19"/>
              <signal group="OUT" index="0" function="I" pad="PB02"/>
              <signal group="OUT" index="0" function="I" pad="PB23"/>
              <signal group="OUT" index="1" function="I" pad="PA11"/>
              <signal group="OUT" index="1" function="I" pad="PA31"/>
              <signal group="OUT" index="1" function="I" pad="PB11"/>
              <signal group="OUT" index="2" function="I" pad="PA25"/>
              <signal group="OUT" index="2" function="I" pad="PB09"/>
              <signal group="OUT" index="3" function="I" pad="PB17"/>
            </signals>
            <parameters>
              <param name="GCLK_ID" value="38" caption="GCLK index for CCL"/>
              <param name="IO_NUM" value="12" caption="Numer of input pins"/>
              <param name="LUT_NUM" value="4" caption="Number of LUT in a CCL"/>
              <param name="SEQ_NUM" value="2" caption="Number of SEQ in a CCL"/>
              <param name="INSTANCE_ID" value="87"/>
            </parameters>
          </instance>
        </module>
