bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAMC21_DFP/1.2.176/samc21/atdf/ATSAMC21J16A.atdf
        <register name="CFGA" offset="0x2" rw="RW" size="2" initval="0x0000" caption="Config A register">
          <bitfield name="REFNUM" caption="Number of Reference Clock Cycles" mask="0xFF"/>
        </register>
        <register name="INTENCLR" offset="0x8" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear Register">
          <bitfield name="DONE" caption="Measurement Done Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTENSET" offset="0x9" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set Register">
          <bitfield name="DONE" caption="Measurement Done Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTFLAG" offset="0xA" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="Interrupt Flag Register">
          <bitfield name="DONE" caption="Measurement Done" mask="0x1"/>
        </register>
        <register name="STATUS" offset="0xB" rw="RW" size="1" initval="0x00" caption="Status Register">
          <bitfield name="BUSY" caption="FREQM Status" mask="0x1"/>
          <bitfield name="OVF" caption="Sticky Count Value Overflow" mask="0x2"/>
        </register>
        <register name="SYNCBUSY" offset="0xC" rw="R" size="4" initval="0x00000000" caption="Synchronization Busy Register">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
        </register>
        <register name="VALUE" offset="0x10" rw="R" size="4" initval="0x00000000" caption="Count Value Register">
          <bitfield name="VALUE" caption="Measurement Value" mask="0xFFFFFF"/>
        </register>
      </register-group>
    </module>
    <module name="GCLK" id="U2122" version="1.1.1" caption="Generic Clock Generator">
      <register-group name="GCLK" caption="Generic Clock Generator">
        <register name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Control">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
        </register>
        <register name="SYNCBUSY" offset="0x4" rw="R" size="4" initval="0x00000000" caption="Synchronization Busy">
          <bitfield name="SWRST" caption="Software Reset Synchroniation Busy bit" mask="0x1"/>
          <bitfield name="GENCTRL0" caption="Generic Clock Generator Control 0 Synchronization Busy bits" mask="0x4" values="GCLK_SYNCBUSY__GENCTRL"/>
          <bitfield name="GENCTRL1" caption="Generic Clock Generator Control 1 Synchronization Busy bits" mask="0x8" values="GCLK_SYNCBUSY__GENCTRL"/>
          <bitfield name="GENCTRL2" caption="Generic Clock Generator Control 2 Synchronization Busy bits" mask="0x10" values="GCLK_SYNCBUSY__GENCTRL"/>
          <bitfield name="GENCTRL3" caption="Generic Clock Generator Control 3 Synchronization Busy bits" mask="0x20" values="GCLK_SYNCBUSY__GENCTRL"/>
          <bitfield name="GENCTRL4" caption="Generic Clock Generator Control 4 Synchronization Busy bits" mask="0x40" values="GCLK_SYNCBUSY__GENCTRL"/>
          <bitfield name="GENCTRL5" caption="Generic Clock Generator Control 5 Synchronization Busy bits" mask="0x80" values="GCLK_SYNCBUSY__GENCTRL"/>
          <bitfield name="GENCTRL6" caption="Generic Clock Generator Control 6 Synchronization Busy bits" mask="0x100" values="GCLK_SYNCBUSY__GENCTRL"/>
          <bitfield name="GENCTRL7" caption="Generic Clock Generator Control 7 Synchronization Busy bits" mask="0x200" values="GCLK_SYNCBUSY__GENCTRL"/>
          <bitfield name="GENCTRL8" caption="Generic Clock Generator Control 8 Synchronization Busy bits" mask="0x400" values="GCLK_SYNCBUSY__GENCTRL"/>
        </register>
        <register name="GENCTRL" offset="0x20" rw="RW" size="4" count="9" initval="0x00000000" caption="Generic Clock Generator Control">
          <bitfield name="SRC" caption="Source Select" mask="0x7" values="GCLK_GENCTRL__SRC"/>
          <bitfield name="GENEN" caption="Generic Clock Generator Enable" mask="0x100"/>
          <bitfield name="IDC" caption="Improve Duty Cycle" mask="0x200"/>
          <bitfield name="OOV" caption="Output Off Value" mask="0x400"/>
          <bitfield name="OE" caption="Output Enable" mask="0x800"/>
          <bitfield name="DIVSEL" caption="Divide Selection" mask="0x1000" values="GCLK_GENCTRL__DIVSEL"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x2000"/>
          <bitfield name="DIV" caption="Division Factor" mask="0xFFFF0000"/>
        </register>
        <register name="PCHCTRL" offset="0x80" rw="RW" size="4" count="41" initval="0x00000000" caption="Peripheral Clock Control">
          <bitfield name="GEN" caption="Generic Clock Generator" mask="0xF" values="GCLK_PCHCTRL__GEN"/>
          <bitfield name="CHEN" caption="Channel Enable" mask="0x40"/>
          <bitfield name="WRTLOCK" caption="Write Lock" mask="0x80"/>
        </register>
      </register-group>
      <value-group name="GCLK_SYNCBUSY__GENCTRL">
        <value name="GCLK0" caption="Generic clock generator 0" value="0x1"/>
        <value name="GCLK1" caption="Generic clock generator 1" value="0x2"/>
        <value name="GCLK2" caption="Generic clock generator 2" value="0x4"/>
        <value name="GCLK3" caption="Generic clock generator 3" value="0x8"/>
        <value name="GCLK4" caption="Generic clock generator 4" value="0x10"/>
        <value name="GCLK5" caption="Generic clock generator 5" value="0x20"/>
        <value name="GCLK6" caption="Generic clock generator 6" value="0x40"/>
        <value name="GCLK7" caption="Generic clock generator 7" value="0x80"/>
        <value name="GCLK8" caption="Generic clock generator 8" value="0x100"/>
      </value-group>
      <value-group name="GCLK_GENCTRL__SRC">
        <value name="XOSC" caption="XOSC oscillator output" value="0"/>
        <value name="GCLKIN" caption="Generator input pad" value="1"/>
        <value name="GCLKGEN1" caption="Generic clock generator 1 output" value="2"/>
        <value name="OSCULP32K" caption="OSCULP32K oscillator output" value="3"/>
        <value name="OSC32K" caption="OSC32K oscillator output" value="4"/>
        <value name="XOSC32K" caption="XOSC32K oscillator output" value="5"/>
        <value name="OSC48M" caption="OSC48M oscillator output" value="6"/>
        <value name="DPLL96M" caption="DPLL96M output" value="7"/>
      </value-group>
      <value-group name="GCLK_PCHCTRL__GEN">
        <value name="GCLK0" caption="Generic clock generator 0" value="0x0"/>
        <value name="GCLK1" caption="Generic clock generator 1" value="0x1"/>
        <value name="GCLK2" caption="Generic clock generator 2" value="0x2"/>
        <value name="GCLK3" caption="Generic clock generator 3" value="0x3"/>
        <value name="GCLK4" caption="Generic clock generator 4" value="0x4"/>
        <value name="GCLK5" caption="Generic clock generator 5" value="0x5"/>
        <value name="GCLK6" caption="Generic clock generator 6" value="0x6"/>
        <value name="GCLK7" caption="Generic clock generator 7" value="0x7"/>
        <value name="GCLK8" caption="Generic clock generator 8" value="0x8"/>
      </value-group>
      <value-group name="GCLK_GENCTRL__DIVSEL">
        <value name="DIV1" caption="Divide input directly by divider factor" value="0x0"/>
        <value name="DIV2" caption="Divide input by 2^(divider factor+ 1)" value="0x1"/>
      </value-group>
    </module>
    <module name="HMATRIXB" id="I7638" version="2.1.3" caption="HSB Matrix">
      <register-group name="PRS" size="0x8">
        <register name="PRAS" offset="0x0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Priority A for Slave">
          <bitfield name="M0PR" caption="Master 0 Priority" mask="0xF"/>
          <bitfield name="M1PR" caption="Master 1 Priority" mask="0xF0"/>
          <bitfield name="M2PR" caption="Master 2 Priority" mask="0xF00"/>
          <bitfield name="M3PR" caption="Master 3 Priority" mask="0xF000"/>
          <bitfield name="M4PR" caption="Master 4 Priority" mask="0xF0000"/>
          <bitfield name="M5PR" caption="Master 5 Priority" mask="0xF00000"/>
          <bitfield name="M6PR" caption="Master 6 Priority" mask="0xF000000"/>
          <bitfield name="M7PR" caption="Master 7 Priority" mask="0xF0000000"/>
        </register>
        <register name="PRBS" offset="0x4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Priority B for Slave">
          <bitfield name="M8PR" caption="Master 8 Priority" mask="0xF"/>
          <bitfield name="M9PR" caption="Master 9 Priority" mask="0xF0"/>
          <bitfield name="M10PR" caption="Master 10 Priority" mask="0xF00"/>
          <bitfield name="M11PR" caption="Master 11 Priority" mask="0xF000"/>
          <bitfield name="M12PR" caption="Master 12 Priority" mask="0xF0000"/>
          <bitfield name="M13PR" caption="Master 13 Priority" mask="0xF00000"/>
          <bitfield name="M14PR" caption="Master 14 Priority" mask="0xF000000"/>
          <bitfield name="M15PR" caption="Master 15 Priority" mask="0xF0000000"/>
        </register>
      </register-group>
      <register-group name="HMATRIXB" caption="HSB Matrix">
        <register name="MCFG" offset="0x0" rw="RW" size="4" access-size="4" count="16" initval="0x00000002" caption="Master Configuration">
          <bitfield name="ULBT" caption="Undefined Length Burst Type" mask="0x7" values="HMATRIXB_MCFG__ULBT"/>
        </register>
        <register name="SCFG" offset="0x40" rw="RW" size="4" access-size="4" count="16" initval="0x00000010" caption="Slave Configuration">
          <bitfield name="SLOT_CYCLE" caption="Maximum Number of Allowed Cycles for a Burst" mask="0xFF"/>
          <bitfield name="DEFMSTR_TYPE" caption="Default Master Type" mask="0x30000" values="HMATRIXB_SCFG__DEFMSTR_TYPE"/>
          <bitfield name="FIXED_DEFMSTR" caption="Fixed Index of Default Master" mask="0x3C0000"/>
          <bitfield name="ARBT" caption="Arbitration Type" mask="0x1000000" values="HMATRIXB_SCFG__ARBT"/>
        </register>
        <register-group name="PRS" name-in-module="PRS" offset="0x080" size="0x8" count="4"/>
        <register name="MRCR" offset="0x100" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Master Remap Control">
          <bitfield name="RCB0" caption="Remap Command Bit for Master 0" mask="0x1" values="HMATRIXB_MRCR__RCB0"/>
          <bitfield name="RCB1" caption="Remap Command Bit for Master 1" mask="0x2" values="HMATRIXB_MRCR__RCB1"/>
          <bitfield name="RCB2" caption="Remap Command Bit for Master 2" mask="0x4" values="HMATRIXB_MRCR__RCB2"/>
          <bitfield name="RCB3" caption="Remap Command Bit for Master 3" mask="0x8" values="HMATRIXB_MRCR__RCB3"/>
          <bitfield name="RCB4" caption="Remap Command Bit for Master 4" mask="0x10" values="HMATRIXB_MRCR__RCB4"/>
          <bitfield name="RCB5" caption="Remap Command Bit for Master 5" mask="0x20" values="HMATRIXB_MRCR__RCB5"/>
          <bitfield name="RCB6" caption="Remap Command Bit for Master 6" mask="0x40" values="HMATRIXB_MRCR__RCB6"/>
          <bitfield name="RCB7" caption="Remap Command Bit for Master 7" mask="0x80" values="HMATRIXB_MRCR__RCB7"/>
          <bitfield name="RCB8" caption="Remap Command Bit for Master 8" mask="0x100" values="HMATRIXB_MRCR__RCB8"/>
          <bitfield name="RCB9" caption="Remap Command Bit for Master 9" mask="0x200" values="HMATRIXB_MRCR__RCB9"/>
          <bitfield name="RCB10" caption="Remap Command Bit for Master 10" mask="0x400" values="HMATRIXB_MRCR__RCB10"/>
          <bitfield name="RCB11" caption="Remap Command Bit for Master 11" mask="0x800" values="HMATRIXB_MRCR__RCB11"/>
          <bitfield name="RCB12" caption="Remap Command Bit for Master 12" mask="0x1000" values="HMATRIXB_MRCR__RCB12"/>
          <bitfield name="RCB13" caption="Remap Command Bit for Master 13" mask="0x2000" values="HMATRIXB_MRCR__RCB13"/>
          <bitfield name="RCB14" caption="Remap Command Bit for Master 14" mask="0x4000" values="HMATRIXB_MRCR__RCB14"/>
          <bitfield name="RCB15" caption="Remap Command Bit for Master 15" mask="0x8000" values="HMATRIXB_MRCR__RCB15"/>
        </register>
